<template>
  <div class="">
    <div>
      <div>
        <img src="" alt="" />
      </div>
      <div>
        <!-- <div>{{ single.date }}</div> -->
        <div>
          <div class="icon">
            <Icons icon="carbon:view-filled" :size="16" />
          </div>
          <!-- <p>{{ single.count }}</p> -->
        </div>
      </div>
    </div>
    <div>
      <h1>ТОП 10 КРОССОВОК НЬЮ БАЛАНС ЗА ВСЮ ИСТОРИЮ</h1>
      <div>
        Вы точно слышали о кроссовках «made in USA». Надпись «сделано в США» появлялась на
        коробках из-под обуви, рекламных баннерах и самих кроссовках. Обувь New Balance (в
        переводе «Новый баланс») имеет огромную историю, которая началась раньше Nike и
        Adidas. Но все началось совсем не с обуви. И даже не с США. </br>Мы собрали интересные
        факты об истории и 10 лучших кроссовок New Balance по годам.
      </div>
    </div>
    <div>
        <div>P.S. <div class="orange">Промокод «НБ» даст дополнительную скидку на -15%</div>на все товары. Увеличьте общую скидку до 65% и закажите стильные кроссовки.</div>
        <img src="@/assets/img/copied.svg">
    </div>
    <h3>Как курица помогла создать отличные кроссовки New Balance</h3>
    <p>В начале 1900-х годов обувь начала напоминать современные кроссовки, которые мы носим сегодня. Но это касалось лишь внешнего вида. По уровню комфорта обувь 100-летней давности была очень неудобной. Кто-то должен был изменить это!</p>
    <img src="/assets/img/posts/cheack.png">
    <div>30-летний ирландец Уильям Райли устал от скучной жизни на родине и эмигрировал в США. В 1906 году он открыл свою компанию с длинным названием New Balance Arch Support Company.</br> С самого начала бренд Уильяма Райли занимался производством не обуви, а стелек и супинаторов. Идея о создании такого необычного бизнеса пришла к нему при наблюдении за обычной курицей. Предприниматель обратил внимание, что эти птицы идеально удерживают баланс на трех пальцах. Такую способность было нужно перенести на супинаторы для обуви. </br>И это действительно сработало. Супинаторы использовали все: от обычных людей до пожарных, полицейских, стюардесс и официантов, которые много двигаются. </br>В 1938 году наступил день «Икс». В компании появляется первая обувь для бейсбола. И лишь в 1960 выходят первые кроссовки New Balance Trackster. С этого дня New Balance начнет покорять мир спорта и повседневной моды. Но какие из моделей стали настоящими хитами?
    </div>
    <ImagesBlock v-for="(item, i) in imagesListPosts" :key="'images-item-' + i" :block="item"/>
    <p>Мы любим New Balance за их комфорт и стиль. Если вы тоже любите их или хотите попробовать свою первую пару, это лучшее время!</p>
    <div>
        <div>P.S. Кроссовки New Balance и других брендов можно заказать на нашем сайте уже сейчас<div class="orange"> С ДОПОЛНИТЕЛЬНОЙ СКИДКОЙ -15% ПО ПРОМОКОДУ «НБ».</div>Чтобы применять его, впишите в своей корзине при покупке. Стильных покупок!</div>
        <img src="@/assets/img/copied.svg">
    </div>
     <Buttons class="w-full" size="large">Все кроссовки New Balance</Buttons>
     <div>
    
    <div>
      <h4>Блог</h4>
      <ul class="grid grid-cols-3 lg:gap-[60px]">
        <li v-for="item in posts">
          <NewsCard :post="item" />
        </li>
      </ul>
    </div>
     </div>
  </div>
</template>

<script setup lang="ts">
import ImagesBlock from '@/components/Shared/ImagesBlock.vue';
import Buttons from '@/components/Buttons/Buttons.vue';
import NewsCard from '@/components/Cards/NewsCard.vue';

const posts = [
  {
    img: "/assets/img/post.png",
    title: "ТОП 10 КРОССОВОК НЬЮ БАЛАНС ЗА ВСЮ ИСТОРИЮ",
    date: "17.04.2025",
    description:
      "Вы точно слышали о кроссовках «made in USA». Надпись «сделано в США»...",
    view: "122",
    id: "212",
  },
  {
    img: "/assets/img/post.png",
    title: "ТОП 10 КРОССОВОК НЬЮ БАЛАНС ЗА ВСЮ ИСТОРИЮ",
    date: "17.04.2025",
    description:
      "Вы точно слышали о кроссовках «made in USA». Надпись «сделано в США»...",
    view: "122",
    id: "212",
  },
  {
    img: "/assets/img/post.png",
    title: "ТОП 10 КРОССОВОК НЬЮ БАЛАНС ЗА ВСЮ ИСТОРИЮ",
    date: "17.04.2025",
    description:
      "Вы точно слышали о кроссовках «made in USA». Надпись «сделано в США»...",
    view: "122",
    id: "212",
  },
];



const imagesListPosts = [
  {
    img: '/assets/img/posts/1.jpg',
    title: 'New Balance 990 (1982)',
    txt: 'Одними из первых популярных кроссовок New Balance стала модель 990. Она отличились, как только вышла в 1982 году. Во-первых, компания потратила на ее разработку 500 тысяч долларов! Во-вторых, это первые кроссовки в истории, которые продавали за 100 долларов. Но зато взамен люди NB 990 получали невероятное качество с кэжуал дизайном, который сочетается с разными стилями одежды.',
    btn: 'New Balance 990'
  },
  {
    img: '/assets/img/posts/2.jpg',
    title: 'New Balance 990 (1982)',
    txt: 'Одними из первых популярных кроссовок New Balance стала модель 990. Она отличились, как только вышла в 1982 году. Во-первых, компания потратила на ее разработку 500 тысяч долларов! Во-вторых, это первые кроссовки в истории, которые продавали за 100 долларов. Но зато взамен люди NB 990 получали невероятное качество с кэжуал дизайном, который сочетается с разными стилями одежды.',
    btn: 'New Balance 990'
  },
  {
    img: '/assets/img/posts/3.jpg',
    title: 'New Balance 990 (1982)',
    txt: 'Одними из первых популярных кроссовок New Balance стала модель 990. Она отличились, как только вышла в 1982 году. Во-первых, компания потратила на ее разработку 500 тысяч долларов! Во-вторых, это первые кроссовки в истории, которые продавали за 100 долларов. Но зато взамен люди NB 990 получали невероятное качество с кэжуал дизайном, который сочетается с разными стилями одежды.',
    btn: 'New Balance 990'
  },
  {
    img: '/assets/img/posts/4.jpg',
    title: 'New Balance 990 (1982)',
    txt: 'Одними из первых популярных кроссовок New Balance стала модель 990. Она отличились, как только вышла в 1982 году. Во-первых, компания потратила на ее разработку 500 тысяч долларов! Во-вторых, это первые кроссовки в истории, которые продавали за 100 долларов. Но зато взамен люди NB 990 получали невероятное качество с кэжуал дизайном, который сочетается с разными стилями одежды.',
    btn: 'New Balance 990'
  },
]


</script>

<style scoped lang="scss"></style>
