export const posts = [
  {
    img: "/assets/img/post.png",
    title: "ТОП 10 КРОССОВОК НЬЮ БАЛАНС ЗА ВСЮ ИСТОРИЮ",
    date: "17.04.2025",
    description:
      "Вы точно слышали о кроссовках «made in USA». Надпись «сделано в США»...",
    view: "122",
    id: "212",
  },
  {
    img: "/assets/img/post.png",
    title: "ТОП 10 КРОССОВОК НЬЮ БАЛАНС ЗА ВСЮ ИСТОРИЮ",
    date: "17.04.2025",
    description:
      "Вы точно слышали о кроссовках «made in USA». Надпись «сделано в США»...",
    view: "122",
    id: "212",
  },
  {
    img: "/assets/img/post.png",
    title: "ТОП 10 КРОССОВОК НЬЮ БАЛАНС ЗА ВСЮ ИСТОРИЮ",
    date: "17.04.2025",
    description:
      "Вы точно слышали о кроссовках «made in USA». Надпись «сделано в США»...",
    view: "122",
    id: "212",
  },
  {
    img: "/assets/img/post.png",
    title: "ТОП 10 КРОССОВОК НЬЮ БАЛАНС ЗА ВСЮ ИСТОРИЮ",
    date: "17.04.2025",
    description:
      "Вы точно слышали о кроссовках «made in USA». Надпись «сделано в США»...",
    view: "122",
    id: "212",
  },
  {
    img: "/assets/img/post.png",
    title: "ТОП 10 КРОССОВОК НЬЮ БАЛАНС ЗА ВСЮ ИСТОРИЮ",
    date: "17.04.2025",
    description:
      "Вы точно слышали о кроссовках «made in USA». Надпись «сделано в США»...",
    view: "122",
    id: "212",
  },
];
